import random

l={1:{'Фінансові ресурси':"сукупність коштів, які знаходяться у розпорядженні держави, \nсуб'єктів господарювання і населення. ",
      'Регулююча функція фінансів':"пов'язана з втручанням держави через фін механізм \nу процес суспільного відтворення.  ",
      'Контрольна функція фінансів':"виявояється у контролі за робподілом і перерозподілом \nввп за відповідними ффр і витрачання цих коштів відповідно до їх цільового призначення.", 
   'Розподільча функція фінансів':"пов'язана з розподілом і перерозподілом ввп в результаті \nчого формуються централізовані і децентралізовані ффр. ",
   'Фінанси':"це сукупність економічних відносин, що пов'язані з формуванням, розподілом \nі використанням фондів грошових коштів в процесі розподілу і перерозподілу ввп та національного доходу. ",
   'Предмет фін науки':"це сукупність фін відносин, що виникають на різних етапах розподілу і перерозподілу ввп, на різних рівнях економічної системи, між різними суб'єктами цих відносин \nі економічною основою яких є рух варстості у її грошовій формі.",
   'Фін. наука':'це система знань про фін явища і процеси,( які виникають в державі в процесі \nстворення і використання ффр, для забезпечення виконання державою її функцій)'},
    2:{'Фінансове право':"це сукупність правових норм що регламентують фін відносини з приводу формування,\n розподілу використання цент. і децентр фгр з метою забезпечення виконання державою її функцій і завдань. ",
       'Фінансовий контроль':"сукпність дій та операцій з перевірки фінансових та пов'язаних з ними питаннь \nдіяльності суб'єктів господарювання і управління із застосуванням специфічних форм і методів його організації.",
       'Фінансове планування':"підсистема фін механізму, що включає планування процесів формування, розподілу\n і вокористання центр та децентр фондів фін ресурсів.",
       'Фінансовий механізм':"це сукупність економіко-організаційних та правових форм і \nметодів управління фін діяльністю, яка застосовується суспільством з метою забезпечення сприятливих умов для соц- економічного розвитку держави.",
       'Фінансова тактика':"це вирішення поточних фінансових задач.",
       'Фінансова стратегія':"курс фін політики на перспективу.",
       'Фінансова політика':"це система заходів у сфері фінансів, що здійснюється з метою \nцілеспрямованого впливу держави на розвиток фін-кредитної системи та національної економіки взагалі.",
       'Фінанси домогосподарств':"це сукупність економ відносин, які пов'язані з формуванням,\n розподілом і використанням фондів грошових коштів домогосполарств, з метою відтворення і розвитку людського капіталу \nта задоволення потреб членів цих господарств і суспільства загалом.",
       'Фінансовий ринок':"це сукупність ринкових фінансових інститутів, що скеровують потік\n коштів від власних заощаджень до позичальників.",
       'Фінанси підприємств':"це сукупність економ відносин, які пов'язані з формуванням, \nрозподілом і використанням фондів фін ресурсів суб'єктів господарювання.",
       'Централізовані фонди цільового призначення':"грошові фонди, що формуються з метою \nфінансування суспільних видатків, не входять до держ бюджету.",
       'Державні фінанси':"це центральна ланка фінансової системи, через яку держава \nздійснює вплив на соціально-економічний розвиток держави. Або ж це сукупність економ відносин, які пов'язані \nз формуванням, розподілом і використанням централізованих фондів фін ресурсів. ",
       'Фінансова система':"це сукупність урегульованих фінансово- правовими нормами \nокремих сфер та ланок фінансових відносин, а також це сукупність установ та організацій , \nза допомогою яких держава впливає на формування , розподіл та використання центр та децентр фондів грошових коштів."},
    3:{"Державний дохід":"це грошові відносини що виникають з приводу розподілу і \nперерозподілу ввп, його акамуляції в децентр та централізованих ффр з метою забезпечення виконання державою її функцій і завдань. ",
       "Доходи (держ) бюджету":"це економічні відносини, що виникають між дежавою та фіз \nі юр особами в процесі формування бюджетних фондів держави. ",
       "Трансферти ":"це безповоротне, безоплатне перерахування коштів. ",
       "Поточні видатки":"це видатки бюддетів на фінансування поточних витрат.",
       "Видатки розвитку":"це витрати бюджетів на фінансування інвестиційної та інноваційної діяльності. ",
       "Бюджетне фінансування":"це безповоротне, безоплатне витрачання коштів бюджетів \nрізних рівнів на виконання загальнодердавних фугкцій, функцій місцевого самоврядування та забезпечення бюджетних підприємств, установ і організацій. ",
       "Державні дотації":"це форма бюджетного фінансування плановозбиткових підприємств,\n доходи яких не покривають видатки. ",
       "Кошторисно ":"бюджетне фінансування - фінансування установ, організацій що повністю \nперебувають на державному фінансуванні, на основі фін планів-кошторисів. ",
       "Фінанси місцевих орг влади":"це грошові відносини що виникають з приводу розподілу\n і перерозподілу ввп, його акамуляції  в централізованих ффр з метою забезпечення виконання покладених на них функцій."
       },
    4:{"Державний бюджет":"це головний фін план держави на поточний рік.",
       "Розподільча функція":"виявляється у розподілі і перерозподілі фінансових ресурсів \nміж усіма учасниками суспільного виробництва за допомогою бюджетних фондів.  ",
       "Контрольна бюджет функція ":"розкривається в процесі надходження і використання \nфінансових ресурсів, що зосереджені в бюджеті.",
       "Забезпечення економічної безпеки держави":"реалізується шляхом створення \nматеріально – технічної бази для функціонування держави.",
       "Бюджетна політика":"це комплекс заходів спрямованих на залучення розподіл і \nвикористання коштів держ бюджету.",
       "Бюджетні кошти":"належні відповідно до законодавства надходження бюджету\n та витрати бюджету;",
       "Бюджетне асигнування":"повноваження розпорядника бюджетних коштів, надане \nвідповідно до бюджетного призначення, на взяття бюджетного зобов'язання та здійснення платежів, яке має кількісні, часові та цільові обмеження.",
       "Міжбюджетні трансферти":"кошти, які безоплатно і безповоротно передаються \nз одного бюджету до іншого. ",
       "Бюджетний устрій":"це організація і принципи побудови бюджетної системи, \nвзаємозв'язок між її ланками  ",
       "Бюджетна система":"це сукупність бюджетів країни всіх рівнів. ",
       "Місцеві бюджети":"це система формування, розподілу і використання фінансових \nресурсів для забезпечення місцевими органами влади покладених на них функцій і завдань як власних, так і делегованих.",
       "Бюджетний процес":"це регламентований законодавством порядок складання, розгляду, \nзатвердження бюджетів, їх виконання і контроль за їх виконанням, затвердження звітів про виконання бюджетів, що входять до складу бюджетної системи.",
       "Закон про деж бюджет України":"закон, який затверджує Державний бюджет України на \nпоточний рік та містить положення щодо забезпечення його виконання протягом бюджетного періоду. "
       },
    5:{"Податки ":"це обов’язковий елемент економічної системи будь-якої держави, основна\n форма її доходів.",
       "Функції податків ПЕРЕЧИСЛИТИ":"Фіскальна, Контрольна, Розподільча, Регулююча.",
       "іскальна функція податків":"пов’язана із забезпеченням доходів бюджету для \nзадоволення потреб суспільства.",
       "Контрольна функція податків":"пов’язана із забезпеченням доходів бюджету для \nзадоволення потреб суспільства, реалізується в процесі оподаткування. ",
       "Розподільча функція податків ":"пов’язана із первинним і вторинним розподілом ВВП, \nформуванням доходів бюджетних фондів та їхнє використання для забезпечення реалізації завдань і функцій держави. ",
       "Регулююча(стимулююча,дестимулююча) функція податків":"формує систему пільг, зміну \nоб’єктів оподаткування, ставок, кількості податків, може сприяти розвитку виробництва або його стримувати.",
       "Податкова система":"це сукупність законодавчо встановлених у державі різних видів\n податків і зборів, а також принципів, форм, методів оподаткування та організації податкової роботи\n і контролю за дотриманням податкового законодавства",
       "Платники податку":"це фізичні особи, юридичні особи та їх відокремлені підрозділи, \nякі мають, одержують  об’єкти оподаткування або провадять діяльність",
       "Об'єкт оподаткування":"предмет, який оподатковуються тим чи іншим податком, явище \nчи процес, внаслідок наявності яких сплачується податок, приклад дохід, майно товар.",
       "База оподаткування":"законодавчо закріплена частина доходів чи майна платника податків,\n яка враховується при розрахунку суми податку.",
       "Ставка податку":"це законодавчо встановлений розмір податку на одиницю оподаткування.  ",
       "Податкова пільга":"це повне або часткове звільнення конкретних платників податку \nвід оподаткування по кожному конкретному податку за певних умов (знижки, вирахування тощо). ",
       "Місцеві податки":"встановлюються місцевими органами влади відповідно до переліку \nі в межах затверджених граничних розмірів ",
       "Загальнодержавні податки":"встановлюються вищими органами влади і діють на всій території держави",
       "Податкові соціальні пільги":"це сума, яку віднімають від зарплати працівника при \nнарахуванні податку на доходи фізичних осіб",
       "Податкові пільги":"це повне або часткове звільнення конкретних платників податку \nвід оподаткування по кожному конкретному податку за певних умов (знижки, вирахування тощо).",
       "Сутність податкового регулювання ринку":"формує систему пільг, зміну об’єктів \nоподаткування, ставок, кількості податків, може сприяти розвитку виробництва або його стримувати.",
       "Основні елементи податкової роботи":"Суб'єкти податку, об'єкти оподаткування, \nПредмет оподаткування, ставка податку, звітний період, податковий періодд, податковий звіт, порядок сплати податку, податкові пільги, \nодиниця оподаткування, база оподаткуванння, джерело сплати",
       "Нормативно-правове регулювання оподаткування в Україні":"Основним законом, \nщо регулює податкові відносини в Україні, є Податковий кодекс України. "},
    6:{"Фінанси підприємств  як економічна категорія":"це система економічних відносин, \nяка виникає у процесі формування, розподілу та використання  грошових коштів підприємства, установ, організацій. ",
       "Функції фінансів суб’єктів господарювання: ":"Акумулююча,Розподільна,Контрольна",
       "Принципи організації фінансів суб’єктів господарювання:":"Самостійність, Саморегулювання, Самоокупність, \nсамофінансування, плановість, господарський розрахунок, фінансова відповідальність.",
       "Капітал ":"це вартість, яка внаслідок ефективного використання, здатна приносити \nдодаткову вартість (прибуток);",
       "Основний капітал":"капітал інвестований у всі види необоротних активів підприємства. ",
       "Оборотний капітал":"капітал інвестований у всі види його оборотних (поточних) активів. ",
       "Основні засоби (капітал)))":"матеріальні активи, які підприємство формує з метою \nвикористання у процесі виробництва чи постачання товарів, надання послуг тощо. ",
       "нематеріальні активи":"активи, що не мають матеріальної форми, використовуються більше одного року ",
       "довгострокові фінансові інвестиції":"це вкладення коштів в цінні папери інших \n емітентів  з метою отримання економічних вигод в майбутньому з терміном більше одного року,\n а також всі інвестиції, які  не можуть бути вільно реалізованими у будь-який момент часу. ",
       "Фінансові ресурси підприємств":"грошові доходи та надходження, що знаходяться в \n розпорядженні підприємства і призначені для виконання фінансових зобов’язань, фінансування поточних витрат, здійснення витрат щодо розширеного відтворення \n на підприємстві та матеріального стимулювання працюючих. ",
       "Склад фінансових ресурсів суб’єктів господарювання":"Прибуток, Амортизаційні відрахування, Грошові кошти, Бюджетні асигнування, Надходження з цільових фондів, Надходження з централізованих корпоративних фондів, Кредити та інші ресурси. ",
       "Грошові витрати підприємства":"включають витрати, що виникають у процесі \nфінансово-господарської діяльності підприємства і пов`язані з придбанням техніки, обладнання, сировини, \nматеріалів, напівфабрикатів, оплатою послуг інших підприємств, \nвиплатою зарплати, ремонтом основних фондів, відрахуваннями до бюджетних та державних цільових фондів. ",
       "Собівартість продукції":"це комплексний економічний показник, який об'єднує в \nсобі витрати матеріалізованої праці і витрати живої праці. ",
       "Балансовий прибуток  підприємств":"сума прибутку підприємства за усіма видами \nйого діяльності, відображена у бухгалтерському балансі. ",
       "Чистий прибуток  як результат діяльності підприємства":"алгебраїчна сума прибутку \nвід звичайної діяльності, надзвичайного прибутку, надзвичайних збитків та податків із надзвичайного прибутку.",
       "Чистий дохід":"сума доходу підприємства, яка залишається в його розпорядженні \nпісля виплати з отриманого валового доходу сум податкових платежів, включених до ціни продукції.",
       "Собівартість продукції":"це комплексний економічний показник, який об'єднує в \nсобі витрати матеріалізованої праці і витрати живої праці. ",
       "Некомерційних організацій":"Суб`єкти господарювання (установи, організації), що \nне ставлять на меті отримання прибутку, працюють на некомерційних засадах. ",
       "Фінансовий план":"план формування та розподілу фінансових ресурсів підприємства.",
       "Фінансове планування":"це розроблення системи фінансових планів за окремими \nнапрямами фінансової діяльності підприємства, які забезпечують реалізацію його фінансової стратегії у плановому періоді. ",
       "Оперативне фінансове планування":"процес конкретизації надходжень і використання \nфінансових ресурсів підприємства за короткі проміжки часу ( місяць, декада, тиждень, день). "
       },
    7:{"Фінанси домогосподарств":"це економічні відносини, які виникають у фізичних \nосіб з державою, підприємствами,  іншими фізичними особами з приводу формування, розподілу та використання грошових фондів громадян. ",
       "Сукупний дохід домогосподарства":"грошові й натуральні надходження  \nдомогосподарств з метою задоволення їх особистих потреб.",
       "Функції фінансів домогосподарств:":"Розподільча, регулююча,контрольна,Інвестиційна. ",
       "Розподільна функція фінансів домогосподарств":"реалізується у відносинах домогосподарств \nз іншими сферами або ланками фінансової системи, у результаті чого утворюються первинні і вторинні доходи домогосподарств.",
       "Споживчий бюджет":"баланс доходів і витрат домогосподарства, що 	характеризує \nосновні джерела доходів, основні напрямки і величину витрат  домогосподарства. ",
       "Кінцеві доходи домогосподарства":"сукупні доходи домо- господарства з урахуванням відрахувань з них. ",
       "Споживчий попит ":"це представлена на ринку й обмежена рамками платоспроможної можливості потреба в товарах та послугах ",
       "Бюджет домогосподарства":"фонд грошових коштів, доходи якого формуються з надходжень \nгрошових коштів членів сім’ї, а витрати є використанням ними поточних і нагромаджених ресурсів ",
       "Фінансовий портфель":"це сукупність фінансових активів фізичної особи. \nВін є джерелом особистого споживання, накопичення та інвестиційних вкладень. ",
       "Фінансовий портфель складається з трьох портфелів:":"споживчого; накопичувального; інвестиційного."
       },
    8:{"Необхідність страхового захисту":"пояснюється появою в процесі соціально-економічного \nрозвитку все нових ризиків, руйнівна сила яких може сягати таких збитків, протистояти одноосібно яким подекуди неможливо.",
       "Страхування":"це система заходів щодо створення фондів (як правило, грошових), \nпризначених для повного або часткового відшкодування витрат суб’єктами господарювання від непередбачених обставин, а також надання допомоги населенню при настанні страхових випадків. ",
       "Страховий захист":"система відносин між людьми щодо попередження, подолання та \nзнешкодження руйнівних наслідків від несприятливих, непередбачуваних подій.",
       "Сутність страхового захисту як економічної категорії":"полягає в тому, \nщо цей \nрізновид людської діяльності спрямований на захист майнових інтересів юридичних і фізичних осіб, постраждалих унаслідок настання страхових випадків, \nвизначених договором чи страховим законодавством, за допомогою сформованих учасниками страхування страхових фондів. ",
       "Об’єкти страхування":"Майнові інтереси, які не суперечать чинному законодавству \nУкраїни і пов’язані: З життям, здоров’ям, працездатністю, додатковою пенсією страхувальника або застрахованої особи. \nВолодінням, користуванням, розпорядженням майном (майнове страхування). \nІз відшкодуванням страхувальником заподіяної ним шкоди іншій особі, або чужому майну, або юридичній особі (страхування відповідальності).",
       "Функція страхування Ризикова":"передавання за певну плату страховикові матеріальної \nвідповідальності за наслідки ризику, зумовленого подіями, зазначених в договорі страхування. ",
       "Функція страхування Заощаджувальна":"Заощадження грошових сум за допомогою страхування \nна дожиття пов'язане з потребою в страховому захисті досягнутого сімейного статку. ",
       "Функція страхування Превентивна":"пов'язана з використанням частини страхового фонду на зменшення наслідків страхового ризику.",
       "Функція страхування Контрольна":"страхування випливає з указаних вище трьох \nспецифічних функцій і проявляється одночасно з ними в конкретних страхових івідносинах в умовах страхування. ",
       "Класифікація страхування:":"за формами проведення, за спеціаліацією страховика, \nза об’єктами страхування ,за характером небезпеки страхових ризиків ,за статусом страхувальника, за організаційно-правовою формою страховика ",
       "Принципи страхування:":"Загальні: Вільний вибір страховника і виду страхування, \nстраковий ризик, страховий інтерес, максимальная сумлінність, Реальність страхового заисту \n Конкретні: Принцип платності,Принцип неперервності, Принцип повороності,\n Принцип диверсифікації, принцип франшизи, принцип суброгаціїх, принип контрибуції, принцип співтраування та переструхвання",
       "Страховий ринок":"це складова ринку фінансових послуг, сфера діяльності \nучасників страхового ринку для надання і одержання страхових послуг;",
       "Страховик ":"юридична особа - страхова компанія, яка діє на підставі відповідної \nліцензії, беручи на себе зобов'язання щодо створення колективного страхового фонду і виплати з нього страхового \nвідшкодування страхувальнику або третій особі, на чию користь укладений договір, при настанні страхового випадку; ",
       "Страхувальник ":"юридична чи фізична особа, яка на підставі відповідної угоди зі \nстраховиком сплачує страхові внески до страхового фонду й отримує право на відшкодування збитків у разі настання страхового випадку; ",
       "Застрахований ":"юридична чи фізична особа, якій належить страхове відшкодування \nу разі настання страхового випадку.",
       "Застрахована особа":"фізична особа, визначена страхувальником у договорі \nстрахування, життя, здоров’я, працездатність та/або пенсійне забезпечення якої \nє об’єктом страхування за договором страхування.",
       "Страхове поле":"це наявність потенційних страхувальників з певного виду страхування. "
        },
    9:{"Міжнародні фінанси":"це сукупність  економічних відносин, що пов’язані з\n формуванням та використанням фондів грошових коштів, у процесі здійснення міжнародної економічної діяльності. ",
       "Міжнародні фінанси як економічна категорія":"міжнародні фінанси являють собою \nсукупність відносин, опосередкованих рухом валютно-фінансових потоків, що виникають у зв’язку з перерозподілом фінансових ресурсів \nі капіталу в системі світового господарства через дію ринкового і неринкового механізмів.",
       "Основою міжнародних фінансів":"міжнародні валютні потоки, що складаються в \nпроцесі функціонування світового господарства і обслуговують взаємний обмін результатами діяльності національних господарств. ",
       "Міжнародна фінансова система":"це форма організації та регулювання інвалютних \nпотоків, закріплена нормами міжнародного права, міжнародними та регіональними \nугодами, національними законодавствами країн – учасниць міжнародної фінансової системи.",
       "Міжнародна фінансово-економічна політика":"це сукупність засад, економічних \nметодів, інструментів та рекомендацій за допомогою, яких уряди держав \nздійснюють регулювання міжнародної торгівлі, інвестицій, впливають на внутрішнє та зовнішнє фінансування національної економіки.",
       "Світове фінансове середовище":"це середовище, яке визначає умови зростання \nсвітового фінансового ринку і впливає на рішення, що  приймаються директорами банків, керівниками фінансів корпорацій та інвесторами; ",
       "Міжнародна організація":" це об`єднання держав у відповідності з нормами \nміжнародного права і на підставі міжнародного договору для здійснення міжнародного співробітництва \nв політичній, економічній, культурній, науково-технічній, правовій та інших сферах, що має необхідну для цього систему органів управління та права й обов'язки. ",
       "Міжнародний валютний фонд":"спеціалізована установа ООН, створена в 1945 р.\n з метою сприяння міжнародному співробітництву в сфері валютної політики, забезпечення\n збалансованого розвитку міжнародної торгівлі, підтримки стабільності виплат та упорядкування валютних відносин \nміж країнами-членами, ліквідації незбалансованості платіжних балансів країн-членів тощо. ",
       "Світовий банк":"Мета функціонування Світового банку – економічний розвиток \nкраїн-членів за допомогою перерозподілу фінансових ресурсів, досягнення зростання життєвого рівня та скорочення безробіття.",
       "світового фінансового ринку":"сукупність фінансово-кредитних організацій, які \nвиконують посередницькі функції у перерозподілі фінансових активів між кредиторами та позичальниками, продавцями та покупцями фінансових ресурсів ",
       "Фінансова глобалізація":"це вільний та ефективний рух капіталів між країнами й \nрегіонами, функціонування глобального ринку, формування системи наднаціонального регулювання міжнародних фінансів, \nреалізація глобальних фінансових стратегій ТНК і транснаціональних банків. ",
       "РИЗИК":"це небезпека здійснення непередбачуваних і небажаних для суб'єкта \nнаслідків його діяльності;",
       "Фінансова стабільність":"являє собою такий стан динамічної рівноваги, за якого \nфінансово-кредитна система спроможна безперервно та ефективно виконувати свої функції, забезпечуючи розвиток реального сектору економіки та \nпоглинаючи вплив негативних чинників зовнішнього та внутрішнього середовища ",},
    10:{"Виникнення та розвиток грошей":"це тривалий еволюційний процес, зумовлений \nстихійним розвитком товарного виробництва та обміну. ",
        "Гроші":"це специфічний товар, що має властивість обмінюватися на будь-який \nінший товар, тобто є загальним еквівалентом.",
        "Функції грошей":"Міра  вартості, Засіб обігу, Засіб платежу, Засіб нагромадження, \nСвітові гроші",
        "Міра вартості":"це функція грошей, в якій гроші забезпечують вираження і \nвимірювання вартості товарів, надаючи їм форму ціни. ",
        "Засіб обігу":"це функція грошей, в якій гроші виконують роль посередника в\n обміні товарів і забезпечують їх обіг ",
        "Засіб платежу":"це функція грошей, яка полягає в обслуговуванні погашення \nрізноманітних боргових зобов’язань між суб’єктами економічних відносин. ",
        "Засіб нагромадження":"це функція грошей, пов’язана з їхньою здатністю бути \nзасобом збереження вартості, представником абстрактної форми багатства ",
        "Світові гроші":"це функція, в якій гроші обслуговують рух вартості в \nміжнародному економічному обороті і забезпечують реалізацію взаємовідносин між країнами ",
        "Теорії грошей":"це сукупність поглядів представників різних напрямів світової \nекономічної думки про роль і місце грошей в національній та світовій економіці. ",
        "Раціоналістична концепції походження грошей":"Гроші виникли внаслідок угоди \nміж людьми або були запроваджені законодавчами актими держави задля полгшення обміну товарами.  ",
        "еволюційна концепції походження грошей-":"Гроші виникли стихійно як результат \nрозвитку товарного виробнгицтва та обміну, зумовленого тривалим еволюційним процесом розвитку форм власності.",
        "Товарні гроші":"товар, який у будь-який час можна обміняти на іншу споживну \nвартість",
        "Паперові гроші":"Важливими ознаками паперових грошей є «відсутність» їх \nвласної вартості,  їх несталість та можливість знецінення ",
        "Кредитні гроші ":"це неповноцінні знаки вартості, які виникли на основі \nкредитних відносин. ",
        "Електронні гроші":"умовна назва грошових коштів, які використовуються на \nоснові електронної системи банківських послуг. ",
        "Депозитні гроші":"вид кредитних грошей, що створюються на основі банківських \nвкладів і системи спеціальних розрахунків, які здійснюються між банками шляхом перенесення сум з одного рахунку на інший. ",
        "Криптовалюта":"різновид цифрової валюти, емісія та облік якої виконується \nдецентралізованою платіжною системою повністю в автоматичному режимі (без можливості внутрішнього або зовнішнього адміністрування).",},
        11:{"Грошовий обіг ":"це рух грошей при виконанні ними усіх  притаманних їм функцій; - пов'язаний з рухом грошей як грошей, тобто як посередника у процесі товарообміну:Г – Т або Т – Г",
            "Сукупний грошовий оборот ":"кругооборот усього сукупного капіталу суспільства на всіх стадіях  суспільного відтворення. Це явище макроекономічного характеру",
            "Оборот грошей в межах індивідуального капіталу ":"оборот окремого індивідуального капіталу, тобто це явище  мікроекономічного рівня.",
            "Закон грошового обігу ":"визначає причинно-наслідковий зв'язок між кількістю грошей в обігу, його швидкістю, товарною масою, рівнем цін та іншими чинниками",
            "Швидкість обігу грошей  ":"показник, що відображає інтенсивність руху грошей, як засобів обігу та платежу; характеризує частоту, з якою кожна грошова одиниця наявних в обороті грошей (гривня, долар тощо) використовується в середньому для здійснення трансакцій за певний період (рік, квартал, місяць).",
            "Грошово-кредитний мультиплікатор ":"Процес створення безготівкових грошей при кредитуванні банками клієнтури на основі вільних резервів, що надійшли банку ззовні.",
            "Грошова маса ":"сукупність грошей у всіх формах, що перебувають в економічному обороті на певний момент часу. ",
            "Активна частина грошової маси":"Грошові кошти, що реально обслуговують грошовий обіг",
            "Пасивна частина грошової маси":"Грошові накопичення, залишки на рахунках, що можуть бути плітжними засобами",
            "Грошовий агрегат ":"показник грошової маси; це визначене законодавством відповідно до ступеня ліквідності специфічне групування ліквідних активів, які можуть слугувати вимірниками грошової маси.",
            "Грошова база ":"є відображенням грошової маси на балансі центрального банку АБО сукупність готівкових коштів, випущених в обіг Національним банком України, коштів обов’язкових резервів, коштів на кореспондентських рахунках та інших коштів інших депозитних корпорацій (банків), коштів інших фінансових корпорацій, нефінансових корпорацій і домашніх господарств (працівників Національного банку) у Національному банку України ",
            "Модель сукупного грошового обороту":"відображає рух доходів і витрат чотирьох груп суб'єктів грошового обороту: фірм, сімейних господарств, державних  структур (уряду), фінансових посередників. ",
            "Грошові потоки":"це потоки доходів та витрат основних суб'єктів грошового обороту.",
            "Механізм балансування грошових потоків":"система, що урівноважує потоки припливу і відпливу ",
            "Емісієя":"Випуск в обіг грошових знаків, цінних паперів",
            "Грошовий оборот ":"це процес безперервного руху грошей між суб'єктами економічних відносин у суспільному відтворенні; пов'язаний з рухом грошей як капіталу",
            "Вільний резерв ":"сукупність грошових коштів комерційних банків, які в даний момент є в розпорядженні банку і можуть бути використані ним для активних операцій"},
        
        12:{"Грошова система":"форма організації грошового обороту в країні, що склалася історично і встановлена національним законодавством, де визначено основні принципи, правила, нормативи, що регламентують відносини між суб’єктами грошового обороту",
            "Грошова одиниця":"це встановлений в законодавчому порядку грошовий знак, що використовується для виміру, співставлення та вираження цін усіх товарів ",
            "Валютний курс ":"співвідношення між грошовими одиницями (валютами) різних країн, що залежить від їхньої купівельної спроможності.Характеризує  “ціну” валюти однієї країни, виражену у валюті іншої країни.",
            "Платіжна система":"Це платіжна організація, учасники платіжної системи та сукупність, відносин, що виникають між ними при переказуванні коштів",
            "Масштаб цін":"Визначає фіксований державою ваговий вміст у грошовій одиниці металу, який у відповідний період виконував роль грошей. ",
            "Емісійна система":"включає порядок готівкової й безготівкової емісії та обігу грошових знаків ",
            "Регламентація безготівкових грошових розрахунків":"Здійснюється державою шляхом встановлення: порядку функціонування грошей, зарахування на рахунки, форм розрахунків, порядку платежів тощо.",
            "Регламентація готівкового грошового обороту":"- проводиться з метою контролю операцій з готівкою, які досить часто обслуговують тіньовий сектор економіки ",
            "регламентація режиму валютного курсу та операцій із валютними цінностями":"надзвичайно важливий і ефективний елемент грошової системи, який в усіх країнах активно використовується для захисту і забезпечення сталості національної валюти",
            "Тип грошової системи":"Визначається змістом її елементів та їх взаємодією, які обумовлюють тенденції розвитку та закономірності функціонування грошової системи.",},
        13:{"":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",},
        14:{"":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            },
        15:{"":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",
            "":"",},
        16:{}}

random.seed(random.randint(0,12))

class perechislenie:
    def __init__(self,num) -> None:
        self.chek=False
        if type(num)==tuple:
            self.chek=True
            self.num=num[0]
            self.num2=num[1] 
        else:
            self.num=num 
    def schet(self):
        if self.chek:
            while True:
                tema=l[random.randint(self.num,self.num2)]
                key,value=random.choice(list(tema.items()))
                print(f"Термін --- {key}")
                b=input('>>> Введіть в - для відповіді або н - для наступного, Так же ввести с щоб зупинити опитування з цих тем\n ')
                if b=='н':
                    continue
                elif b=='в':
                    print(f"Відповідь --- {key} --{value}")
                elif b=='с':
                    break
        else:
            while True:
                tema=l[int(self.num)]
                key,value=random.choice(list(tema.items()))
                print(f"Термін --- {key}")
                b=input('>>> Введіть в - для відповіді або н - для наступного, Так же ввести с щоб зупинити опитування з цих тем\n ')
                if b=='н':
                    continue
                elif b=='в':
                    print(f"Відповідь --- {key} --{value}")
                elif b=='с':
                    break

class coman:
    def __init__(self,num) -> None:
        self.num=num
    def creator(self):
        if len(self.num)>2:
            l=self.num.split('-')
            return int(l[0]), int(l[1])
        else:
            return int(self.num)



while True:
    x=input('>>> Щоб обрати одну тему достатньо напечати цифру 1 або 10. \nЯкщо діапазонт тем, то 1-4 або 2-6 або 6-7. \nЯкщо треба вийди напиши вихід\n')
    if x =='вихід':
        break
    else:
        c=coman(x)
        h=perechislenie(c.creator())
        h.schet()
                